# TimeSeries

In [2]:
import numpy as np
import pandas as pd
from datetime import datetime

## Time Series Analysis

In [3]:
data ={'date':['2018-01-01','2018-02-01',
'2018-03-01', '2018-04-01',
'2018-05-01', '2018-06-01',
'2018-01-01', '2018-02-01',
'2018-03-01', '2018-04-01',
'2018-05-01', '2018-06-01'],
'visitors': [35,30,82,26,
83, 46,40,57,95,57,87,42]}

In [4]:
df =pd.DataFrame(data,
columns=['date', 'visitors'])

Convert Pandas columns into date objects.

In [5]:
df['date'] =pd.to_datetime(df['date'])

In [6]:
# set an index and sort the dataframe by that index.
df.set_index('date', inplace=True)
df.sort_index(inplace=True)

In [7]:
df.head()

            visitors
date
2018-01-01        35
2018-01-01        40
2018-02-01        30
2018-02-01        57
2018-03-01        82

In [8]:
df

            visitors
date
2018-01-01        35
2018-01-01        40
2018-02-01        30
2018-02-01        57
2018-03-01        82
2018-03-01        95
2018-04-01        26
2018-04-01        57
2018-05-01        83
2018-05-01        87
2018-06-01        46
2018-06-01        42

In [10]:
#filter by date
df.loc['2018-05']

            visitors
date
2018-05-01        83
2018-05-01        87

In [9]:
df[datetime(2018,3,1):]

            visitors
date
2018-03-01        82
2018-03-01        95
2018-04-01        26
2018-04-01        57
2018-05-01        83
2018-05-01        87
2018-06-01        46
2018-06-01        42

In [12]:
df.truncate(after='2018-03-01')

            visitors
date
2018-01-01        35
2018-01-01        40
2018-02-01        30
2018-02-01        57
2018-03-01        82
2018-03-01        95

In [13]:
df.groupby('date').count()

            visitors
date
2018-01-01         2
2018-02-01         2
2018-03-01         2
2018-04-01         2
2018-05-01         2
2018-06-01         2

In [15]:
# The resample method lets us change the frequency in our dataset.
df.resample('ME').mean()

            visitors
date
2018-01-31      37.5
2018-02-28      43.5
2018-03-31      88.5
2018-04-30      41.5
2018-05-31      85.0
2018-06-30      44.0

In [16]:
df.resample('ME').sum()

            visitors
date
2018-01-31        75
2018-02-28        87
2018-03-31       177
2018-04-30        83
2018-05-31       170
2018-06-30        88

 Offset aliases used by Pandas to represent common time series frequencies.
Alias Description
B   businessdayfrequency
C   custombusinessdayfrequency
D   calendardayfrequency
W   weeklyfrequency
M   month-endfrequency
SM  semi-month-end frequency(15th and end of month)
BM  businessmonth-endfrequency
CBM custombusinessmonth-endfrequency
MS  month-startfrequency
SMS semi-month-startfrequency(1stand15th)
BMS businessmonthstartfrequency
CBMS    custombusinessmonth-startfrequency
Q   quarter-endfrequency
BQ  businessquarter-endfrequency
QS  quarterstartfrequency
BQS businessquarter-startfrequency
A,  Yyear-endfrequency
BA, BYbusinessyear-endfrequency
AS, YS year-startfrequency
BAS, BYS business year-startfrequency
BH  business hour frequency
H   hourly frequency
T,  min minutelyfrequency
S   secondlyfrequency
L,  ms milliseconds
U,  us microseconds
N   nanoseconds

In [17]:
df.groupby('date').describe()

           visitors
              count  mean        std   min    25%   50%    75%   max
date
2018-01-01      2.0  37.5   3.535534  35.0  36.25  37.5  38.75  40.0
2018-02-01      2.0  43.5  19.091883  30.0  36.75  43.5  50.25  57.0
2018-03-01      2.0  88.5   9.192388  82.0  85.25  88.5  91.75  95.0
2018-04-01      2.0  41.5  21.920310  26.0  33.75  41.5  49.25  57.0
2018-05-01      2.0  85.0   2.828427  83.0  84.00  85.0  86.00  87.0
2018-06-01      2.0  44.0   2.828427  42.0  43.00  44.0  45.00  46.0

In [19]:
# We can provide a data in plain natural language, and convert it to a datetype.
date=pd.to_datetime("14th of October, 2016")
print(date)

2016-10-14 00:00:00

In [ ]:
# Someformatdirectives for the strftime method.
""" 
Directive Meaning
%a abbreviatedweekdayname
%A full weekdayname
%b abbreviatedmonthname
%B full monthname
%c preferreddateandtimerepresentation
%d dayofthemonth(1 to 31)
%D same as%m/%d/%y
%e dayofthemonth(1 to 31)
%m month (1 to 12)
%M minute
%S second
%u weekdayasanumber(Mon=1 to 7)
"""

In [21]:
date.strftime('%A')

'Friday'

In [ ]:
print( date.strftime('%B'), ',' , date.strftime('%u'))

October , 5

In [ ]:
# timerange by specifying start and end times.
pd.date_range('2018-05-30', '2018-06-02')

DatetimeIndex(['2018-05-30', '2018-05-31', '2018-06-01', '2018-06-02'], dtype='datetime64[ns]', freq='D')

In [26]:
pd.date_range('2018-05-30', periods=4)

DatetimeIndex(['2018-05-30', '2018-05-31', '2018-06-01', '2018-06-02'], dtype='datetime64[ns]', freq='D')

In [ ]:
pd.date_range('2018-05-30', periods=4,freq='M')

In [28]:
from numpy.random import randn
idx =pd.date_range('2018-06-04 00:00:00',
periods=4)
cols =['A','B','C','D']

In [ ]:
# creates an array of m with rows and n columns.
data =randn(len(idx),len(cols))

In [30]:
df =pd.DataFrame(data=data,
index=idx, columns=cols)
df.index.name='date'

In [31]:
df

                   A         B         C         D
date
2018-06-04 -0.734479  0.443866 -0.047658 -1.557907
2018-06-05 -0.422902 -0.470179 -0.134026 -0.372622
2018-06-06 -0.262428  0.773446 -0.689367  2.195224
2018-06-07  0.500962 -0.860853  1.379406  1.642739

In [32]:
df.reset_index(inplace=True)

In [33]:
melted=pd.melt(df,id_vars='date',
var_name='feature',
value_name='reading')
print(melted)

         date feature   reading
0  2018-06-04       A -0.734479
1  2018-06-05       A -0.422902
2  2018-06-06       A -0.262428
3  2018-06-07       A  0.500962
4  2018-06-04       B  0.443866
5  2018-06-05       B -0.470179
6  2018-06-06       B  0.773446
7  2018-06-07       B -0.860853
8  2018-06-04       C -0.047658
9  2018-06-05       C -0.134026
10 2018-06-06       C -0.689367
11 2018-06-07       C  1.379406
12 2018-06-04       D -1.557907
13 2018-06-05       D -0.372622
14 2018-06-06       D  2.195224
15 2018-06-07       D  1.642739

The original columns have become entries in the column called “features” and the values are in the column “reading”.

## Data Manipulation

In [34]:
# sample dataset Apple Inc Prices Apr 2017 - Apr 2018
url='https://figshare.com/articles/dataset/Apple_Inc_Prices_Apr_2017_-_Apr_2018/6339830/1?file=11624558'

In [38]:
appl =pd.read_csv('AAPL.CSV')
appl.Date =pd.to_datetime(appl.Date,
format='%Y-%m-%d')

In [ ]:
appl.set_index('Date', inplace=True)

SyntaxError: invalid character '’' (U+2019) (3733389291.py, line 1)

In [40]:
appl.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2017-04-25,143.910004,144.899994,143.869995,144.529999,142.279205,18871500
1,2017-04-26,144.470001,144.600006,143.380005,143.679993,141.442444,20041200
2,2017-04-27,143.919998,144.160004,143.309998,143.789993,141.550735,14246300
3,2017-04-28,144.089996,144.300003,143.270004,143.649994,141.412918,20860400
4,2017-05-01,145.100006,147.199997,144.960007,146.580002,144.297287,33602900

In [41]:
# The diff method calculates the difference from one time period to the next.
appl['log_ret'] =np.log(appl.Close).diff()

In [42]:
appl['log_ret'].tail(3)

250   -0.002901
251   -0.014017
252    0.004348
Name: log_ret, dtype: float64

### Bitcoin

In [53]:
from datetime import datetime

""" 
we will notice that the date is stored in a column called time_start, and that the format is such that
the day is placed first, followed by the month and the year; the time in hours and minutes is provided. We can use this
information to create a rule to parse the date:
"""
parser =lambda date: datetime.\
    strptime(date, '%d/%m/%Y %H:%M')

In [54]:
# Wespecifythecolumnstobe parsed andhowtheyshallbe parsed!
fname ='bitcoin_usd.csv'
bitcoin =pd.read_csv(fname,
parse_dates=['time_start'],
date_parser=parser,
index_col='time_start')

C:\Users\david\AppData\Local\Temp\ipykernel_31444\1015902748.py:3: FutureWarning: The argument 'date_parser' is deprecated and will be removed in a future version. Please use 'date_format' instead, or read your data in as 'object' dtype and then call 'to_datetime'.
  bitcoin =pd.read_csv(fname,

In [55]:
ticks =bitcoin[['close','volume']]

In [56]:
ticks.resample('5Min').first()

                      close     volume
time_start
2016-03-31 00:00:00  413.27   8.953746
2016-03-31 00:05:00  413.26   0.035157
2016-03-31 00:10:00  413.51  43.640052
2016-03-31 00:15:00  414.98   0.038896
2016-03-31 00:20:00  414.98   0.241800
...                     ...        ...
2016-04-03 23:35:00  420.60   0.000000
2016-04-03 23:40:00     NaN        NaN
2016-04-03 23:45:00     NaN        NaN
2016-04-03 23:50:00  420.60   0.955772
2016-04-03 23:55:00  421.00  58.000000

[1152 rows x 2 columns]

In [57]:
ticks.resample('5Min').mean()

                          close     volume
time_start
2016-03-31 00:00:00  413.270000   2.735987
2016-03-31 00:05:00  413.264000   2.211749
2016-03-31 00:10:00  414.660000  37.919166
2016-03-31 00:15:00  414.982000   5.574657
2016-03-31 00:20:00  414.986000   0.063756
...                         ...        ...
2016-04-03 23:35:00  420.600000   0.000000
2016-04-03 23:40:00         NaN        NaN
2016-04-03 23:45:00         NaN        NaN
2016-04-03 23:50:00  420.600000   0.955772
2016-04-03 23:55:00  420.733333  19.827284

[1152 rows x 2 columns]

In [ ]:
"""
In thiswaywecouldgettheclosingpriceforthedayby
resamplingbydayandrequestingthelastvalue:
"""
ticks.resample('D').last()

             close     volume
time_start
2016-03-31  416.02   0.200000
2016-04-01  417.90  52.099684
2016-04-02  420.30   0.850000
2016-04-03  420.60   0.984358

In [59]:
"""The ohlc() method letsusfindthe
OHLC pricesforournewsampled
data."""
bars=ticks['close'].resample('5Min').ohlc()

In [ ]:
""" 
Pandas willtakethefirstandlastvaluesintheintervaltobe
the openandcloseforthebar.Thenitwilltakethemaxand
min asthehighandlow,respectively.Inthisway,westart
filtering thedata.Forexample,imagineweareinterestedin
the pricesbetween10amand4pmeachday: 
"""
filtered=bars.between_time('10:00', '16:00')

In [62]:
bars.open.at_time('8:00')

time_start
2016-03-31 08:00:00    416.11
2016-04-01 08:00:00    416.02
2016-04-02 08:00:00    420.69
2016-04-03 08:00:00    418.78
Freq: 1440min, Name: open, dtype: float64

In [63]:
bars.open.at_time('8:00').pct_change()

time_start
2016-03-31 08:00:00         NaN
2016-04-01 08:00:00   -0.000216
2016-04-02 08:00:00    0.011225
2016-04-03 08:00:00   -0.004540
Freq: 1440min, Name: open, dtype: float64

In [64]:
bars.tail()

                      open   high    low  close
time_start
2016-04-03 23:35:00  420.6  420.6  420.6  420.6
2016-04-03 23:40:00    NaN    NaN    NaN    NaN
2016-04-03 23:45:00    NaN    NaN    NaN    NaN
2016-04-03 23:50:00  420.6  420.6  420.6  420.6
2016-04-03 23:55:00  421.0  421.0  420.6  420.6

In [68]:
bars.fillna(method='ffill',limit=1)

C:\Users\david\AppData\Local\Temp\ipykernel_31444\733771188.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  bars.fillna(method='ffill',limit=1)

                       open    high     low   close
time_start
2016-03-31 00:00:00  413.27  413.27  413.27  413.27
2016-03-31 00:05:00  413.26  413.28  413.25  413.28
2016-03-31 00:10:00  413.51  414.98  413.51  414.98
2016-03-31 00:15:00  414.98  414.99  414.98  414.98
2016-03-31 00:20:00  414.98  414.99  414.98  414.99
...                     ...     ...     ...     ...
2016-04-03 23:35:00  420.60  420.60  420.60  420.60
2016-04-03 23:40:00  420.60  420.60  420.60  420.60
2016-04-03 23:45:00     NaN     NaN     NaN     NaN
2016-04-03 23:50:00  420.60  420.60  420.60  420.60
2016-04-03 23:55:00  421.00  421.00  420.60  420.60

[1152 rows x 4 columns]

In [ ]:
#Use obj.ffill()
#previos command bars.fillna(method='ffill',limit=1)
bars.ffill()

                       open    high     low   close
time_start
2016-03-31 00:00:00  413.27  413.27  413.27  413.27
2016-03-31 00:05:00  413.26  413.28  413.25  413.28
2016-03-31 00:10:00  413.51  414.98  413.51  414.98
2016-03-31 00:15:00  414.98  414.99  414.98  414.98
2016-03-31 00:20:00  414.98  414.99  414.98  414.99
...                     ...     ...     ...     ...
2016-04-03 23:35:00  420.60  420.60  420.60  420.60
2016-04-03 23:40:00  420.60  420.60  420.60  420.60
2016-04-03 23:45:00  420.60  420.60  420.60  420.60
2016-04-03 23:50:00  420.60  420.60  420.60  420.60
2016-04-03 23:55:00  421.00  421.00  420.60  420.60

[1152 rows x 4 columns]

In [ ]:
df.sort_index(inplace=True)